<template>
  <NavBar></NavBar>
  <div class="wrapper info-default-wrapper">
    <div class="info-default-content">
      <h1>О проекте</h1>
      <p>Данный сайт был разработан в рамках выпускной квалификационной работы. Однако в результате появилась идея
        развивать его дальше.</p>
      <p>Сайт предназначен для агрегации информации об образовательных курсах по программированию, где каждый
        авторизованный пользователь может предложить новый курс, а также оценить или прокомментировать уже существующие
        курсы.</p>
      <p> На данный момент реализован базовый функционал сайта вы можете:</p>
      <ul>
        <li>искать курсы;</li>
        <li>предлагать курсы для публикации (только авторизованные пользователи);</li>
        <li>оставлять отзывы на курсы и отмечать понравившиеся (только авторизованные пользователи);</li>
        <li>оставлять комментарии к курсам и отмечать понравившиеся (только авторизованные пользователи);</li>
        <li>читать новости;</li>
        <li>отмечать понравившиеся новости (только авторизованные пользователи);</li>
        <li>сообщать об ошибках и предложениях по улучшению сайта.</li>
      </ul>
    </div>
  </div>
</template>

<script>
// @ is an alias to /src
import NavBar from '@/components/NavBar.vue'

export default {
  name: 'HomeView',
  components: {
    NavBar
  }
}
</script>